{"shoot the shit": "To chat idly about things that neither person involved in the conversation will be likely to remember.", "eric": "The most amazing person in the entire universe. Everything about him is perfect! He's charming, handsome, intelligent, strong, romantic, funny...everything you want in a guy. It's impossible not to fall in love with him! Once you lay eyes on him, you will know from that very moment that you will never stop loving him.", "xilf": "x-ray i'd like to fuck", "Pornocchio": "A person who embellishes their sexcapades to sound cooler.", "vegicide": "when veggies and fruits, so innocent and un-empowered, are plucked out by the roots, to be greedily devoured", "coin wanking": "the act of jangling change held in a suit trouser pocket, usually performed by male office workers whilst stood chatting to colleagues", "Kenneth": "Kenneth is a chic magnet. He is the nicest straight guy you will ever meet. He is smart and sort of nerdy, but funny and cute at the same time. And of corse, he has awesome hair. Although he can be a butt sometimes, he is still awesome. ", "Jose": "The most common name for Mexican males.", "zetta": "One of the most awesome adjectives the universe has ever known, or will ever know. Usually used as a substitute for \"very,\" \"hella,\" or \"uber.\" Most widely known from the video game character Sho Minamimoto saying \"So zetta slow!\" in the popular Square Enix game The World Ends With You.\rWarning: if used too much, \"zetta\" can become permanently etched in to your everyday vocabulary, potentially causing embarrassment to yourself and/or others around you.", "Nig": "A shortened form of the ancient english word \"nigger\".", "yellow fever": "1.  A term usually applied to white males who have a clear sexual preference for women of asian descent, although it can also be used in reference to white females who prefer asian men.\r\r2.  An infectuous tropical disease carried by mosquitoes.", "sean": "used to define huge sarcastic assholes, that end up becoming amazingly sweet. Seans know exactly how to piss you off and then five seconds later have you cracking up. Huge jerks, but gotta love 'em. ", "Trap": "The area where drug deals are carried out", "foot fetish": "The pure admiration or sexual attraction of barefeet. Usually pertaining to men who can become sexually aroused from the sight of any part of women's feet(including, toes, arches and soles.", "You don't pour my cereal": "You don't know me, you don't know what I do, you haven't lived my life, you don't know my struggles nor trials and tribulations", "immature": "98% of the people on Urban Dictionary", "x3": "An elaboration of the popular  . Also featured in Anime, x3 describes an extatic or cheeky 'cute' character. The 'x' depicts eyes tightly scrunched together.\r\rIn internet chatter, x3 is often used as a  to describe one's playfull or joking intentions.", "Masturdating": "Going out alone. I.e. seeing a movie by yourself, going to a restaurant alone.", "zombie jesus": "An exclamation of surpise or shock originating on Matt Groening's 'Futurama' animated TV show as a futuristic equivalent of the modern usage of 'Jesus Christ' as an exclamation. Usually preceded by the words 'sweet' or 'holy'.", "cincinnati bowtie": "When you reverse titty-fuck a girl.  So your balls and cock are upside-down and it looks like she is wearing a fleshy bow-tie.  It's called \"cincinnati\" because they do everything backwards there.", "united states": "If you don't like it, go live in Canada mother fuckers.", "quife": "a fart from the vagina usually during sexual intercourse when the penis stimulates the farthest point of the vagina", "zac efron": "The latest throwaway bubblegum-pop teenybopper idol. Starred in such 'hits' as  and Hairspray. Will be forgotten once he gains a little weight or does his first stint in rehab for substance abuse.", "Isabel": "a smart and beautiful girl with a great personality that brings joy and laughter to people.\risa -bel: derrived from the french word belle, meaning beautiful.", "unconditional love": "To love somebody with no conditions or circumstances: to love completely", "white privilege": "The  idea that simply being white benefits people in some unexplainable way, and that discriminating against white people is not only okay, but enlightened and necessary. The excuse some extremists use to justify pretty much any level of , as long as it is coming from people of color. A young American woman died because in college she was brainwashed into believing that her white privilege would protect her from being run over by a bulldozer. ", "Oppa": "A respectful Korean term used by females to call older males such as older male friends or older brothers, but now with the Hallyu kickin' in, people are using it being as annoying as the Japanese, \"Kawaii\" wave.\r\rUsually used in the annoying way by crazy kpop or jpop fangirls.", "carcolepsy": "a condition affecting buddies on a trip who fall asleep as soon as the car starts moving, providing no company or driving help", "xkcd": "1. Saving a few seconds at a long red light via elaborate and questionably legal maneuvers.\r2. Having someone call your cell phone to figure out where it is.\r3. Calling the Ackermann Function with Graham's Number as the argument just to horrify mathematicians.\r4. Instinctively constructing rules for which floor tiles it's okay to step on and then walking funny ever after", "zOMFG": "usually spelled entirely in caps, this abbreviation originates from the typo you get when you strike the shift key in order to type , but you miss and hit the z instead.", "rocket surgery": "(n.) a play on words which mixes two common metaphors: \"\" and \"\"", "Overrated": "Anything that is given too much credit and hype.", "Marissa": "She is the hottest girl around and will always be there for you. She is amazing, gorgeous, funny, sweet, everything a guy could want in a girl. No other girl could ever compete with her, and she will always be someone's number one. She always makes your head turn as she passes you buy in the hall. She is like a magnet for your eyes. she is like a rainbow on a cloudy day, or a sun rise after a dark night. When she walks in a dark room she lights up the entire room just with her smile. when you see her you can not help but wish you had her in your arms. She has the most beautiful eyes you wish you could just sit and stare into them for hours on end. She has a beautiful body and anyone who doesn't have her is jealous of the guy that does. The guy that has her knows he is not good enough for her, for nobody is good enough for her she is an angel that fell from heaven and no normal guy, like anyone on this planet, can ever hope to have her. she is a goddess among humans. She is everything!!", "it's been real": "A phrase used as a farewell, when the experience shared has been of unique, experimental, or strange phenomenon. Also, a manner of stating that surreal time frame has been shared between two or more peeps.", "tom cruise": "Overrated douchebag who practices  and poisons today's youth", "legit": "Real.\rMeaning: Not fake or Real(Cool).", "goddammit": "A military expression of encouragement.", "Wingman": "Wingman \rA Wingman is a guy you bring along with you on singles \routings (like to bars) that helps you out with the women. \r\rTypically in these ways : \r• The Wingman will always be there to “occupy” least \rattractive girl of the pair so that you may engage in the “hotty” \r• Often, when an attractive girl is out with an ugly friend, she often feels restricted to not leave that ugly friend alone, thus making the hot girl, un-touchable. \r• When the wingman technique is used, both girls are \rapproached by the men, and the Wingman automatically \rengages in conversation with the ugly girl. \r• Now that the hot friend sees that the ugly girl has finally found a man, she is now free to start scouting. \r• This is where you come in “unexpectidly” and “accidentaly”, and begin catching up on “old times” with the Wingman. \r• The Wingman then offers the ugly girl to dance, (which \rrarley happens to her) so she wont be able to resist. \r\rTwo situations may arise: \r1.) She tells her hot friend to come along, in which you \rautomatically MUST be invited, since you know the \rWingman, and have already been introduced to the hotty. \r2.) They go dance, leaving you and the hotty in for \rsome solid face time. \r• At the end of the night, after you have worked your \rmagic, the Wingman, AND ONLY THE WINGMAN, offers \rthe girls to comeback to his place for a little ‘after party’. \r• Once everyone arrives, the Wingman “occupies” the \rugly girl IN ANOTHER ROOM, leaving yourself and the \rsweet sweet little hotty alone so that you can bang her, bang her like a drum....\r\rImportant note: Keep in mind that a wingman \rshould never be too inexperienced or he will hold \ryou back…the Wingman should always be of equal \ror greater knowledge then you. \r\rLearning and practiceing the Wingman support system \ris an unbelievable asset if done right. Your wingman is \ran invaluable assistant for you so don't underestimate \rthe value of finding a Wingman that can work with you. \r\"Hey Buddy, are you gonna be my Wingman tonight?\"\r", "end of an error": "January 20,2009 the last day of the Bush presidency", "Ghost Cheeks": "Where you sit on a toilet seat and can still feel the warmth where the previous occupant was sitting.", "drew": "Generally a smart, caring, intelligent, slightly sarcastic guy whose full name is usually Andrew. Also, very handsome and charming. Ass-hole tendencies are sporatic, but infrequent.", "youtube moment": "A moment or short event where you wish you had a video camera with you. The video equivalent of a .", "farticles": "The particles of air contaminated after someone or something lets out gas.", "Jabroni": "A loser, poser, lame-ass.\r\rOne who talks the talk, but could never walk the walk.\r\rOne who talks shit and doesn't back it up, but rather ends up eating their shit in return.\r\rA fuckin 'tard.", "vegi-curious": "One who is considering the vegetarian lifestyle, but has yet to make a committment to it.", "duff": "Designated Ugly Fat Friend", "Tori": "someone of great nature, beauty, ediquette, and intellegent. often reffered to in the sense of a godlike being", "go down on": "To go down on a woman is to start her off with nice, long, passionate kisses on the lips, and then down to her neck, and then down to her breasts where you have your pleasure with them, and then you kiss your way across her tummy, and finally, you have ultimate pleasure with orally pleasing her pussy.", "Killuminati": "Pac was talking about killing illuminati. Illuminati is the elite ruling circle, the 34th degree of the Freemason click, which is a century old brotherhood of anglo-saxon protestants. He was tellin you to kill that shit. They're the cats that maintain all the inequality and oppression, supposedly. He came out with this whole theory after his prison stint, and after reading Machiavelli's 'The Prince.' Now it's on us.", "Jerk": "The kind of guy most girls ACTUALLY want when they say they want a .\r\rJerks are selfish, manipulative bastards who see women as little more then sexual conquests to brag about to their buddies or mere objects that are there for their personal pleasure. As to ensure the post-sex breakup will be in their favor, Jerks often play the \"sensative guy\" early on so the girl will make most of the moves on HIM, and after he's done with her and dumps her for some other girl just like her, he can make it look like she's at fault for coming on too strong, and consequently she'll take him back if he chooses to return for seconds.\r\rTypically are/were s, s, and s in school.", "etm.": "Latin abbreviation for the literal translation of \"\", specifically, \"et merda\". Just like \"\" (and so forth), \"\" (that is), and \"\" (for example), \"etm.\" can be used to abbreviate \"\".", "bro": "Obnoxious partying males who are often seen at college parties. When they aren’t making an ass of themselves they usually just stand around holding a red plastic cup waiting for something exciting to happen so they can scream something that demonstrates how much they enjoy partying. Nearly everyone in a fraternity is a bro but there are also many bros who are not in a fraternity. They often wear a rugby shirt and a baseball cap. It is not uncommon for them to have spiked hair with frosted tips.\r\rBros actually chose this name for themselves as they often refer to each other as \"bro\" even though they are not related.", "manther": "The male version of a cougar; an older man who preys on younger women.", "net lag": "A feeling like jetlag that happens after you use your computer after sunset and the bright backlight tricks your body into thinking it's still daytime.(For details, google \"photoentrainment\".)", "Juan": "The number before two.", "yo momma": "The answer to any question, when the correct answer could not be attained at the present time.", "fanfiction": "I noticed most of the other definitions here completely trash fanfiction.\r\rFirst, definition: Fanfiction is when someone takes either the story or characters (or both) of a certain piece of work, whether it be a novel, tv show, movie, etc, and create their own story based on it. Sometimes people will take characters from one movie and put them in another, which is called a .\r\rMost people who bash fanfiction are not willing to look past the fact that it's based on something else to see that it could be worth reading IF you like the subject. If they don't like the subject, then obviously they are going to automatically dismiss the fanfiction.\r\rIt is true, however, that some fanfictions are rather poorly written and only a few hundred words, and it is also true that some people just write them so they can have their favorite characters have sex (). But, if you take the time to find something decent, you can end up with a fanfiction story that is so close to the original piece of art, that you'd barely notice the difference.", "Grand Theft Impairment": "The 4-hour period of time that you cannot drive or function in society due to playing Grand Theft Auto. You may have the intention to steal a car, kill innocent people, and/or drive recklessly.", "cholo": "A cholo is term implying a Hispanic male that typically dresses in chinos (khahki pants), a wifebeater sleeveless teeshirt or a flannel shirt with only the top buttoned, a hairnet, or with a bandana around the forehead, usually halfway down over the eyes. Cholos often have black ink tattoos, commonly involving Catholic imagery, or calligraphy messages or family names. \r\rCholos often drive low riders.", "Lust": "often confused with love, it is purely physical attraction and has no lasting effect", "latino": "Means \"latin\".  The culture and language of ancient Italy.  The Roman Empire took over most of Europe and influenced their languages and cultures, so it \"latinized\" the continent and the new languages are called Romance Languages (with roots in Rome).\r\rAfter Columbus's discovery of America (the Continent), and the subsequent colonizations of most of the new continent by Spain and Portugal, the latino influence was expanded.\r\rLatino is a person who speaks a romance language (i.e. Italian, Spanish, French, Portuguese) or their cultural heritage comes from any country that speaks any of those languages.\r\rIn the US the word latino is misused to name only people from Latin America.  The Latin America was a term first created to mean \"the part of America ruled by Latino countries, Spain and Portugal\" in opposition to the Anglo-Saxon America, ruled by the British (now Eastern United States).  In this sense, some parts of the United States are part of the Latin America because they were ruled by Spain at some point (California, Arizona, New Mexico, Texas).", "nerdjacking": "In conversation, digressing into extreme and/or unnecessary detail about one’s passion (music, coding, gaming) to an otherwise uninitiated layperson, without awareness or acknowledgement of the listener’s rapidly waning interest or lack of understanding of the subject at hand.", "quadah": "Quarter in a Boston accent.", "Writer's crap": "Derived from 'writer's cramp', writer's crap reffers to a stage when one is only capeable of writing utter crap.", "queer baiting": "When a politician, pundit, or other public figure brings up the completely irrelevant detail about a person's sexuality, true or untrue, as a way of subtly channeling homophobia to attack them.\r\rCompare ", "sophie": "a generally smart and beautiful girl.\r", "hammer ---; , hytham": "One sad motherfucker with no life as seen by his 501,337 decisions (316 per day) he made as an Urban dictionary editor. Assuming he made 316 decisions every day, he would have to had spent 1587 days to get to that number, thats 4.3 years of nonstop editing 24/7. It's obvious to all that he doesn't get out much.", "or the terrorists have won": "the best excuse to get what you want.", "Bazinga": "A catchy phrase to accompany your clever pranks.As popularized by Sheldon Cooper (The Big Bang Theory).", "pink sock": "(n) this is the result of excessive anal plundering; the intestines actually exit through the anus, forming a dangling mass, resembling a pink sock.", "rachel": "A smart, sassy and sexy young woman who knows things from fashion to film to literature, from Manolo Blahniks to Mahatma Gandhi.", "UrbanDictionary.com": "A place on the internet where people of all ages, races, religions, colors, habits, musical preferences, nationalities, politcal views, genders, and sexual orientations can come together to insult each other's ages, races, religions, colors, habits, musical preferences, nationalities, politcal views, genders, and sexual orientations.", "quickie": "It is common after spending years in a relationship for the urgency and thrill once felt with sex to wane. Having a ‘quickie’ now and then....fast sex with little foreplay.....is a great way to spice things up and revive some of the spontaneity and excitement that may be lacking in a mundane love life.\r\rFor those who don’t know, “quickie” is the term given to a sexual romp that is exactly that – quick. It is to the point, exciting and usually quite intense. And it is often more animalistic and lust-driven than regular “romantic” sex.", "wisconsin": "A state that consumes more alcohol and has a higher people-to-bar ratio then any other state in the country.", "rape": "A crime. Quite terrible in nature. Often causes sever phycological damage to victim. Forced sexual intercourse. Often very violent in more then just a sexual way. No I am not some feminazi either! I am a male solider in the airbourne. So dont be saying its only somthing whiny girls dont like.\r\r\"That MOFO raped my good friend. So I took my boys out and we beat him into the hospital.\"", "DILLIGAF": "Does It Look Like I Give A Fuck", "earth": "Mostly harmless.", "H8": "California's propositon 8 (the bill to make gay marriage illegal), as described by opponents of prop 8. Creates the word \"hate\" when read aloud.", "Atheism Plus": "A bunch of frauds. Despite having atheist in its name it really isn't atheism at all. Their goal is to subvert atheism with the religion of feminist indoctrination and bitch about non existent misogyny.To these people any legitimate questioning of feminists and female privilege is grounds for calling anyone a misogynist. Atheism Plus is really nothing more then an attempt at co-opting the meaning of atheism.", "Emergenturd": "A poop that comes on so suddenly that one fears they may not be able to make it to the toilet.", "yard ape": "The term \"yard ape\" refers to a black person. It's derivation is from the lawn ornaments of black coachmen holding lanterns, or black children fishing, or many of the other lawn ornaments of that type. It has devolved into a perjorative term for blacks.", "I'd Hit it": "Vernacular, commonly used by males, meaning, \"I would like to have sexual relations with that female.\"", "XXXX": " made in . Its popular there, but so are a lot of other things which others may frown upon. It has a lot of chemicals and preservatives used in it due to the  heat, so the taste suffers. Source of many jokes, \"Why do queenslanders drink XXXX?\"\r\"Because they cant spell beer\"\rEtc, etc.", "quadfest": "An annual spring event at Radford University involving free live bands and food where students (and some faculty) begin drinking at 12pm on thursday, drink straight through the weekend, and stop drinking at 8am monday. Some years they even have to bring in the National Guard to control the drunken insanity.", "Turd": "Generally, a log-shaped piece of shit.\rNevertheless, they are also found in coil-shape, mushroom-cloud shape, and even \r shape.", "fubar": "short form of \"Fucked up beyond all recognition\", but also a misunderstandment of the german word \"furchtbar\", which means horrible or frightening.", "Spot Tease": "A parking spot that appears to be open, but is actually taken by a small car or motorcycle. Also can refer to a car that takes up 90% of its own spot and 10% of the one next to it, leaving no room for another car to park.", "Platonic jealousy": "When a close friend of yours hangs out with someone else, and you feel jealous that they aren't hanging out with you.", "obamania": "The national obsession with Senator Barack Obama", "Back Door Braggart": "n. A person who states a problem that they have with the express intention of letting everyone know how awesome they think they are, revealing their douche baggery to all.v. Back Door Bragging: The act of expressing a false statement in order to set up the conversation to prove how (seemingly) fantastic the subject finds themselves.effect: typically leads to eye rolls and general annoyance with subject.", "pornfolio": "The mass of porn that one has stored on their computer, generally in a separate folder.", "alexandra": "One of the best friends you could ever meet. Sometimes quiet and patient but when she's around a group shes wild and fun. She is always there to listen to you and give you a hug if you  need one. She is willing to try anything and is very athletic. She can talk for hours or just have no idea what's going on. She is an overall great person to be around.", "violent agreement": "When two people think they are arguing, but fail to realize they actually agree.", "mexican": "Someone hailing or claiming ancestry from Mexico.", "fuck a duck": "An ode to duck fucking to the tune of the popular children's song, \"Row, Row, Row Your Boat\"", "nuke the fridge": "Nuke the fridge is a colloquialism used to refer to the moment in a film series that is so incredible that it lessens the excitement of subsequent scenes that rely on more understated action or suspense, and it becomes apparent that a certain installment is not as good as  previous installment, due to ridiculous or low quality storylines, events or characters.\r\rThe term comes from the film Indiana Jones and the Kingdom of the Crystal Skull, in which, near the start of the movie, Harrison Ford's character survives a nuclear detonation by climbing into a kitchen fridge, which is then blown hundreds of feet through the sky whilst the town disintegrates. He then emerges from the fridge with no apparent injury. Later in the movie, the audience is expected to fear for his safety in a normal fistfight.\r\rFans of the Indiana Jones series found the absurdity of this event in the film to be the best example of the lower quality of this installment in the series, and thus coined the phrase, \"nuke the fridge\".\r\rThe phrase is also a reference to the phrase \"jump the shark\", which has the same meaning, only applied to a television series instead of a film series.\r\rThis phrase is not in common use.", "Anna": "The name for the most awesome person ever, It is impossible to fit so much awesome into any other person.", "loneliness": "You too, huh?", "wop": "An epithet used for those of Italian descent. WOP stands for WithOut Papers. Many Italian immigrants had no papers to identify themselves and were branded as WOPs.", "Joke Insurance": "When two mates have a mutual understanding to laugh at each others jokes, no matter how lame or awkward said joke is, therefore lessening the social failure of the bad joke.", "Human": "A fictional race of  , presented in books, movies, tales and in the . Humans are warm-blooded, soft-skinned, flat-faced, ugly mammals, who tent to make things that are beautiful ugly.  The apes are rather unintelligent (the average intelligence quotient is 100), their main obsessions are domination, copulation (population over 6.600.000.000 and is still growing, it probably will until the apes run out of food, this obsession can also leads to , which is some sort of a psyche decease or highly dangerous side effect), social integration (the more friends they have - the better it is). They are treacherous, best not to trust them. The aggression level is so high that they can't get on without killing each other, every excuse is good to start a military conflict, or at least humiliate the opposing side and show one's domination over the other side. Also, humans are very weird, for example, in a face to face contact to communicate you have not only use words, but also ,  and the so called, overall \"body language\". All in all, they have a tendency for over expression of their feelings, yet sometimes they seem to have no real feelings at all or have extremely shallow feelings. Some of them also believe in \"faith\", which is a thing that serves as an excuse for their mistakes and wrong life decisions. Most of the human governments, if not all of them, are . \r\rHumans also have very weird sense of beauty, they consider ugly things (for example: snow mountains) as \"breath taking\". In most cases they can't even use the simplest logic. Paradoxically, everything in their life must be in a perfect order, everything must have a number, a name, every single item has its very own place in their homes, work places or wherever. They also like lots of entertainment and they can't remain serious when required. It is also worth noticing that in the human societies the  (also known as EQ, also known as inter personal intelligence or emotional intelligence) is far more important than the actual Intelligence Quotient, in other words: it's better if you are charming than if you are intelligent. Humans have created over 3.000 languages and there are more than two hundred countries. The reason why humans don't want to unite is unknown, although they use excuses such as \"culture\", \"languages\" and few other things. In human societies being cynical is perceived as a disadvantage, a bad element of personality. Humans are also very ignorant and arrogant. \r\rA very good example of their ignorance is fiction they create. For some unknown reasons they think that other sentient races - if they, of course, exist, are exactly same as them. A perfect example of this are the fan-made Argonian related modifications for the video game The Elder Scrolls IV: Oblivion, where humans are showing their lack of most basic knowledge and logical reasoning by mistaking reptiles with mammals et cetera. \r\rThe only hope for stopping this madness is the nuclear weapons arsenal, which is possessed by some countries, such as , , , , ,  or . \r\rNote: This is not a sarcastic entry. ", "Vin Diesel": "Vin Diesel is a new element of the , as he is a pure element unto himself. The symbol for Vin Diesel is Vn, because Vd would've implied STDs. This is ironic because the bacteria in Vin Diesel's penis will instantly kill any STD and/or small mammal on contact.", "Zach": "#1. A name of a person who is often smart, cunning, dresses well and likes to have fun.  A party goer that attracts many people with his intellect, jokes, and good smile. \r\r#2. A name of a person who likes to fool around and be with his friends, often very caring about others and has no problem dealing with tools.", "Kochsucker": "One who sucks the proverbial cock of the billionaire Koch brothers. Bonus points for also being a 'sucker' by falling for a prank call from someone posing as a Koch brother.", "anal sex": "this is like, sex in the butt.", "United States of Canada": "All the blue states that voted for Kerry in the 2004 election... the states that are so embaressed that Bush won the election and wish they belong to Canada instead.\r\rContrasted to all the red states, called Jesusland.", "Kathleen": "The most beautiful girl in the world. She is perfect in everyway, and is liked by all. She is loving and caring and will always be there for you. She is gorgeous and sexy. If you happen to come across one, dont ever let her go. I know i wont", "microsoft": "Organisation bent on world domination masquerading as a software company.\r\rSee also ; ", "United States of America": ". \r\rAmerica's a pretty big place, and its full of all different kinds of people everywhere you go. \r\rWe're just a bunch of normal people living in a counrty with a messed up reputation and a mighty big spotlight for a mighty small man.", "Second Life": "A game where desperate people with no lives  or friends get to live out their dreams of social acceptance and sex. \rThe vast majority of Second Life players are unattractive and socially awkward.   ", "Grant": "An amazing guy. Friendly, funny, fantastic. He's a nerd but hot (and wow what a body! Love those abs and ass!). Gotta love him!", "Revenge is a dish best served cold": "Historians are not sure where the saying originated, but it means that revenge is best served not fresh after the insult occurred, but after enough time has passed so that the target won't see it coming.", "naggers": "People who annoy you.", "Olympics withdrawal": "the comedown felt by an Olympics host city when the games are over", "Bailey": "the most amazing girl you will ever meet. very musical and super sweet... also amazingly beautiful even though she doesnt believe it", "Hobosexual": "Adjective. The opposite of metrosexual; one who cares little for one's own appearance.", "prom": "To the students: an excuse for horny young teenagers to get together for a night of drinking, fornication and promiscuity, how romantic!\r\rTo business: a corporate-controlled/ promoted high school \"institution\" that makes the dress shops, hairdressers, flowershops, limo companies, suit rental places, etc more wealthy.\r \rTo the students who don't get to go: a lifelong regret, an occasion that fat chicks can not get a date for.Makes more people unhappy than any one other thing in highschool...", "Kathy": "Kathy is a word to explain one amazing person.the shiz net of all friends. One of the most beautiful and gorgeous people. also one of the kindest.", "It's a Trap": "A phrase mentioned by Admiral  in \"Return of the Jedi\", in which states the obvious: The Rebel fleet fell under a trap set up by the Imperial Navy. Now used in several message boards as a multi-purpose phrase", "daft punk": "They not the ulitmate french duo. They are the ultra-super-ultimate duo in the whole world. One more time, baby!", "trickle down theory": "Theory saying that if the rich get richer they will give their surplus cash to the poor. Of course this theory assumes that the rich aren't greedy bastards that will horde all their money in banks, spend it on two million dollar trips to space which benefit no one except the Russians that take them there, or blow it all on a Super Sweet Sixteen for their retarded daughters who get pissed that their parents got them the $200,000 car instead of the $300,000. ", "lesbian sex": "So in answer to the question How do lesbians have sex? the answer is simple. Like everyone else, it all falls under personal preference. Sex is really such a personal and intimate act that no one answer would fit for everyone, but here are a few particulars to consider ... \r\rBODIES. We sometimes forget that the entire body is an erogenous zone. Sensitive areas include the face, ears, neck, arms, chest, belly, back, butt, and thighs, back of knees, calves, feet and toes. The entire body can be used to excite a woman. Rubbing bodies together, feeling erect nipples or moist pubic area can excite with subtle motions. \r\rFINGERS. Fingers can be delightful to use on those women who enjoy penetration (not all women do). Some women appreciate long, thin fingers while others like the feel of short, strong fingers. No matter what the preference, all women appreciate clean, short, well-filed nails. \r\rHANDS. Running hands up and down a lover's body will often elicit electric responses of passion. From light caresses down the back to deep rubbing across the butt, caressing is an important aspect to sex. Caressing often turns to gentle pinching or tugging at nipples. Lightly running fingers in a tickling motion across the belly and sides will excite many women. Once excitement has built, slipping fingers into the vagina or rubbing against the clitoris will often bring a woman to orgasm. \r\rMOUTH. Kissing is a good place to begin and a very important part of sex. Kisses come in different styles depending on the person, the mood and the moment. Tiny, soft kisses tantalize and intrigue. Deep, open-mouth kisses with tongues entwined convey a depth of passion and longing. Kisses are appropriate for any part of the body, wherever one feels the urge to place them, lightly or with trailing tongues. Gently nibbling or sucking on nipples excites some women, and some women can reach orgasm just from breast arousal. It is important to note reactions to these stimulations as some women dislike having their breasts touched at all. Gently nibbling or sucking on a responsive clitoris is enjoyed by most women and most often results in orgasm.\r\rPELVIC AREA. Some women can reach orgasm by rubbing pelvic areas together or against a lover's leg. This can be done with one partner on top or two women side-to-side.\r\rANAL SEX. Anal sex can include anilingus (licking the anus) and/or penetration. Penetration can be done with a finger or fingers, dildo or butt plug. Some women love anal sex, others do not. Like everything else, it's all personal preference. \r\rDILDOS, VIBRATORS & BUTT PLUGS. (Or objects used to vaginal or anal penetration). Some women use dildos and/or butt plugs some do not. Some use them occasionally; some use them all the time. Dildos come in many different shapes, colors and sizes. Some are shaped as corncobs, fists, dolphins or fingers. Some have attachments to stimulate the clitoris during penetration and some have two ends to stimulate two women at one time. It's all personal preference. \r\rFISTING. Fisting is penetrating a woman's vagina with your entire hand. Fisting requires a lot of concentration and caution. I recommend Hand In The Bush: The Fine Art of Vaginal Fisting, by Deborah Addington, if you want to learn the proper how-to on fisting. \r\rMUTUAL MASTURBATION. Many women enjoy mutual masturbation. Lying while facing each other, simultaneously rubbing and touching each other's clitoris can be educational as well as enjoyable.", "cowra": "A town full of shit talkers and rumors. You can't do a single thing without someone starting shit on it. I advise you to never ever visit or live here.", "hater": "A person that simply cannot be happy for another person's success.  So rather than be happy they make a point of exposing a flaw in that person.\r\rHating, the result of being a hater, is not exactly jealousy.  The hater doesnt really want to be the person he or she hates, rather the hater wants to knock somelse down a notch.", "doppelbangers": "A person who has sexual intercourse with someone that looks identical to them but is not related.", "reddit": "A user generated web 2.0 news website with a lefty, libertarian and geek slant.  Tends to be slightly more upmarket than its larger competitor .  The comment system at reddit actually works unlike the broken system over on digg.  This results in (usually) more intelligent conversations.  One issue with Reddit is that a number of users have installed bots which automatically down vote or up vote specific topics.  In 2007, it was known for its support of Ron Paul (and then later Obama), its anger at George W Bush and Cheney and its opposition to the invasion of Iraq and its opposition to any potential attack on Iran.  Reddit users are also overwhelming against organized religion be it Christian, the Cult of Scientology, Islam or Judaism.\r\rOne annoying or endearing feature of reddit that is also unique is \"theme\" usernames who behavior in stereotyped fashions usually occuring to their chosen username (eg. CAPTAIN_OBVIOUS.)  These can be fun, but they usually wear pretty thin after a few days.\r\rIn general, reddit is a smart forum than digg, although everyone is always saying that slowly reddit is becoming digg while digg is becoming 4chan.", "Xanaps": "Xanaps\r\rThe brief but heavy periods of sleep which commonly accompany the use of the benzodiazepine alprazolam, a.k.a. Xanax.\r\rIf you don't get much sleep at night and decide to take a little Xanax the next day to 'relax', you can expect to be taking a Xanap very shortly afterwards.\r\rOften employed by  of low moral fortitude to get into the pants of unsuspecting young women. These men, incidentally, should be killed with  for their utter .\r\r ", "alexandria": "a beautiful person; that of which is consumed in greatness; usually has nice hair; loves attention; chooses hardcore over normality; friendly yet bitchy; easy to get along with; creative; the leader of the pack; not easily put down; determined; a non hate-ful person; not easily jealous; content with the matter of life; loves realtionships; not as friendly with the same gender as opposed to the male species;smart; daring; and fearful of nothing.", "bra": "a barrier known to all men, that is almost the only thing between us(males) and the holy mounds known as BOOBS, and if you didn't know that your a fuckin' moron.", "Viviana": "1.Not a lier always tells the truth and hates drama but never causes it.Super fun to hang out with.Always hyper.Very loveable and easy to talk to.A Viviana is defined as a person who hates hypocrites."}